Documents/Монтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Монтаж</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМонтажники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтажник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СвободныеМонтажники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеМонтажники</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоМонтажников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМонтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Монтаж/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	РеквизитыСпецификации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Спецификация, "УслугаМонтаж, Контрагент");
	
	Если РеквизитыСпецификации.УслугаМонтаж И ПервыйМонтаж(РеквизитыСпецификации.Контрагент) Тогда
		
		Запись = Движения.СвободныеМонтажники.Добавить();
		Запись.Город = Спецификация.Офис.Город;
		Запись.Период = Дата;
		Запись.КоличествоМонтажей = 1;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОснованиеДоговор 			= ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор");
	ОснованиеСпецификация 	= ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Спецификация");
	
	Если ОснованиеДоговор или ОснованиеСпецификация Тогда
		
		Спецификация 		= ?(ОснованиеДоговор, ДанныеЗаполнения.Спецификация, ДанныеЗаполнения);
		
		Дата 						= Спецификация.ДатаДоставки;
		Подразделение 		= Спецификация.Производство;
		ДатаМонтажа 			= Спецификация.ДатаМонтажа;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыСпецификации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Спецификация, "Доставка, УслугаМонтаж");
	
	Если НЕ РеквизитыСпецификации.УслугаМонтаж Тогда
		
		Если ЗначениеЗаполнено(Монтажник) Тогда
			
			Отказ = Истина;
			ТекстСообщения = "Спецификация к договору без монтажа. Уберите монтажника";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Монтажник");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПервыйМонтаж(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Монтаж.Ссылка,
	|	Монтаж.Дата,
	|	Монтаж.Спецификация.Контрагент
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Подразделение = &Подразделение
	|	И Монтаж.Спецификация.Контрагент = &Контрагент
	|	И НАЧАЛОПЕРИОДА(Монтаж.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И Монтаж.Ссылка <> &Ссылка
	|	И Монтаж.Проведен";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции // ПовторныйМонтаж()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МонтажСсылка= Документы.Спецификация.ПолучитьМонтаж(Спецификация);
	
	Если ЗначениеЗаполнено(МонтажСсылка) И Ссылка <> МонтажСсылка Тогда
		Отказ = Истина;
		ТекстСообщения = "К " + Ссылка + " уже введен " + МонтажСсылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, МонтажСсылка);
	КонецЕсли;

КонецПроцедуры
